<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"ca27d673511141e2ed6a0d691bf256bd1d21585867cfab8f56b627712e254244","plan_job_ref":"Job Staging Image Build & Push #48 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439469287","plan_hash":"463ff40899d7d756d49d7ae65aa7119dcee0336ae4490fe9d2c1e53bff81a763","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 7 to add, 1 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_lb_association will be created
+   resource "aws_autoscaling_attachment" "asg_lb_association" {
+       autoscaling_group_name = (known after apply)
+       id                     = (known after apply)
+       lb_target_group_arn    = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/3c273cd8ab1a4464"
    }

  # aws_autoscaling_group.ASG_config will be created
+   resource "aws_autoscaling_group" "ASG_config" {
+       arn                              = (known after apply)
+       availability_zones               = (known after apply)
+       default_cooldown                 = (known after apply)
+       desired_capacity                 = 1
+       desired_capacity_type            = "units"
+       force_delete                     = true
+       force_delete_warm_pool           = false
+       health_check_grace_period        = 300
+       health_check_type                = "ELB"
+       id                               = (known after apply)
+       ignore_failed_scaling_activities = false
+       load_balancers                   = (known after apply)
+       max_size                         = 3
+       metrics_granularity              = "1Minute"
+       min_size                         = 1
+       name                             = "fastapi-ASG-dev"
+       name_prefix                      = (known after apply)
+       predicted_capacity               = (known after apply)
+       protect_from_scale_in            = false
+       service_linked_role_arn          = (known after apply)
+       target_group_arns                = (known after apply)
+       vpc_zone_identifier              = (sensitive value)
+       wait_for_capacity_timeout        = "10m"
+       warm_pool_size                   = (known after apply)

+       launch_template {
+           id      = "lt-0fb24dbdf35f7cf64"
+           name    = (known after apply)
+           version = "$Latest"
        }

+       tag {
+           key                 = "AmazonECSManaged"
+           propagate_at_launch = true
+           value               = "true"
        }

+       timeouts {
+           delete = "15m"
        }
    }

  # aws_ecs_capacity_provider.customProvider must be replaced
-/+ resource "aws_ecs_capacity_provider" "customProvider" {
!~      arn      = "arn:aws:ecs:eu-central-1:806066816337:capacity-provider/CustomEC2Provider" -> (known after apply)
!~      id       = "*************************************************************************" -> (known after apply)
        name     = "CustomEC2Provider"
-       tags     = {} -> null
#        (1 unchanged attribute hidden)

!~      auto_scaling_group_provider {
!~          auto_scaling_group_arn         = "arn:aws:autoscaling:eu-central-1:806066816337:autoScalingGroup:9c94fba9-2963-4645-a8e4-e630256d8c4d:autoScalingGroupName/fastapi-ASG-dev" # forces replacement -> (known after apply) # forces replacement
#            (1 unchanged attribute hidden)

!~          managed_scaling {
!~              instance_warmup_period    = 0 -> (known after apply)
!~              maximum_scaling_step_size = 10000 -> (known after apply)
!~              minimum_scaling_step_size = 1 -> (known after apply)
#                (2 unchanged attributes hidden)
            }
        }
    }

  # aws_ecs_cluster.fastapi-cluster will be created
+   resource "aws_ecs_cluster" "fastapi-cluster" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "fastapi-cluster"
+       tags_all = {
+           "Environment" = "Dev Environment"
        }

+       configuration {
+           execute_command_configuration {
+               logging = "DEFAULT"
            }
        }

+       setting {
+           name  = "containerInsights"
+           value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.Provider_config will be created
+   resource "aws_ecs_cluster_capacity_providers" "Provider_config" {
+       capacity_providers = [
+           "CustomEC2Provider",
        ]
+       cluster_name       = "fastapi-cluster"
+       id                 = (known after apply)

+       default_capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "CustomEC2Provider"
+           weight            = 100
        }
    }

  # aws_ecs_service.fastapi-service will be created
+   resource "aws_ecs_service" "fastapi-service" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "EC2"
+       name                               = "dev-fastapi-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       load_balancer {
+           container_name   = "dev_FastAPI_image"
+           container_port   = 5000
+           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/3c273cd8ab1a4464"
        }
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:39" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:f108d505dc8b9a6736c338aa323946e28659b955" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:b92b94011a9d5e1a3913aa93b665bd7b4dbba222"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
+       network_mode             = (known after apply)
!~      revision                 = 39 -> (known after apply)
-       tags                     = {} -> null
#        (4 unchanged attributes hidden)
    }

  # aws_launch_template.ASG_template will be updated in-place
!~  resource "aws_launch_template" "ASG_template" {
        id                      = "lt-0fb24dbdf35f7cf64"
!~      latest_version          = 1 -> (known after apply)
        name                    = "LaunchTemplateECR20240107162659112500000001"
        tags                    = {}
!~      user_data               = "IyEvYmluL2Jhc2gKZWNobyAiRUNTX0NMVVNURVI9ZmFzdGFwaS1jbHVzdGVyIiA+PiAvZXRjL2Vjcy9lY3MuY29uZmln" -> "IyEvYmluL2Jhc2gKZWNobyBFQ1NfQ0xVU1RFUj1mYXN0YXBpLWNsdXN0ZXIgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZw=="
#        (10 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

Plan: 7 to add, 1 to change, 2 to destroy.
```
</details>

:x: Error applying plan in [Staging Image Build & Push #48](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439469287)